In [16]:
import pandas as pd 

f=open('titanic-passengers.csv','r')
chaine=f.read().replace(';',',')
f.close()
f=open('titanic-passengers2.csv','w')
f.write(chaine)
f.close()
# show the head
df = pd.read_csv('titanic-passengers2.csv',encoding="ISO-8859-1")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
343,No,2,Collander,Mr. Erik Gustaf,male,28.0,0,0,248740,13.0,NaN,S
76,No,3,Moen,Mr. Sigurd Hansen,male,25.0,0,0,348123,7.65,F G73,S
641,No,3,Jensen,Mr. Hans Peder,male,20.0,0,0,350050,7.8542000000000005,NaN,S
568,No,3,Palsson,Mrs. Nils (Alma Cornelia Berglund),female,29.0,0,4,349909,21.075,NaN,S
672,No,1,Davidson,Mr. Thornton,male,31.0,1,0,F.C. 12750,52.0,B71,S

In [11]:
#show information about the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 343 to 428
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    object
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          873 non-null    object
 5   Age          732 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    object
 8   Ticket       891 non-null    object
 9   Fare         846 non-null    object
 10  Cabin        249 non-null    object
 11  Embarked     836 non-null    object
dtypes: float64(1), int64(2), object(9)
memory usage: 90.5+ KB

In [15]:
#info about the missing values
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex             18
Age            159
SibSp            0
Parch            0
Ticket           0
Fare            45
Cabin          642
Embarked        55
dtype: int64

In [18]:
#replacing the missing values
df_ = df["Sex"].dropna()
df_.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex             18
Age            159
SibSp            0
Parch            0
Ticket           0
Fare            45
Cabin          642
Embarked        55
dtype: int64